// Задача 41: Пользователь вводит с клавиатуры M чисел. 
// Посчитайте, сколько чисел больше 0 ввёл пользователь.

// 0, 7, 8, -2, -2 -> 2
// 1, -7, 567, 89, 223-> 3

Console.WriteLine("Введите несколько чисел через запятую");
string Mi=Console.ReadLine();
// int [] array = new int[lenth];

// Console.WriteLine($"Массив: {array}");
Console.WriteLine($"{Mi}");